In [2]:
import pandas as pd
df = pd.read_csv('smsspamcollection/Naive_Classifier.csv', 
                   header=None, 
                   names=['label', 'sms_message'])

# Output printing out first 5 rows
df.head()

     label                                        sms_message
0  address  s/o saminathan28/3 nagar 3rd , street, korattu...
1  address    flat 6 ird main 4h nagar, mookordapalli, 635126
2  address   1169 kaviyarasu kannadasan nagar kodungaiyur ...
3  address   1568 bhagavath 21. nedumkadu thiruvananthapur...
4  address   22 nehru colony kumarapalnvam coimbatore ici ...

In [3]:
# Check the shape of the dataset
df.shape

(180741, 2)

In [4]:
#Check if any null values are present in the dataset
df.isnull().sum()

label          0
sms_message    1
dtype: int64

In [5]:
# Remove the null fields
df = df.dropna()
df.shape

(180740, 2)

In [6]:
df.head()

     label                                        sms_message
0  address  s/o saminathan28/3 nagar 3rd , street, korattu...
1  address    flat 6 ird main 4h nagar, mookordapalli, 635126
2  address   1169 kaviyarasu kannadasan nagar kodungaiyur ...
3  address   1568 bhagavath 21. nedumkadu thiruvananthapur...
4  address   22 nehru colony kumarapalnvam coimbatore ici ...

In [7]:
df['label'] = df.label.map({'address':0, 'name':1})
print(df.shape)
df.head() # returns (rows, columns)

(180740, 2)

   label                                        sms_message
0      0  s/o saminathan28/3 nagar 3rd , street, korattu...
1      0    flat 6 ird main 4h nagar, mookordapalli, 635126
2      0   1169 kaviyarasu kannadasan nagar kodungaiyur ...
3      0   1568 bhagavath 21. nedumkadu thiruvananthapur...
4      0   22 nehru colony kumarapalnvam coimbatore ici ...